content/notes/the_learn_reflect_apply_prepare_loop.md
---
title: "The Learn, Reflect, Apply, Prepare Loop"
author: ["Darrell Banks"]
date: 2025-10-08T00:00:00-06:00
lastmod: 2025-11-26T00:00:00-07:00
tags: ["notes"]
draft: false
---

**Connections**: [Thinking]({{< relref "../categories/thinking.md" >}})

The LRAP loop is a system for learning and growth that uses
the four steps as a continuous loop of improvement.


## Learn: Learn something new every day {#learn-learn-something-new-every-day}


### What new idea or perspective did I encounter today? {#what-new-idea-or-perspective-did-i-encounter-today}


## Reflect: Reflect and write to think more clearly {#reflect-reflect-and-write-to-think-more-clearly}


### What does today's learning mean for me? {#what-does-today-s-learning-mean-for-me}


## Apply: Apply what you know {#apply-apply-what-you-know}


### Did I do anything to make use of the knowledge I have generated? {#did-i-do-anything-to-make-use-of-the-knowledge-i-have-generated}


## Prepare: Prepare for the future {#prepare-prepare-for-the-future}


### What did I do today that tomorrow me will thank me for? {#what-did-i-do-today-that-tomorrow-me-will-thank-me-for}
